--该文件放在服务器 放在Data/目录下
--和lua区别在于，等号的两边必须是在同一行，注释行不能有等号
--ids不能有等号
--购买美食后兑换成三种食物的权重
uMSWweight1=50
uMSWweight2 =30
uMSWweight3 =20
--最大食物数量
uMSWmax =45
--自动恢复的食物数量
uMSWrecover =24
--购买一次可兑换的食物数量
uMSWeachBuy =1
--购买食物所需价格
uMSWprice =10
--恢复一次美食烹饪次数的时间（秒）
uMSWtime =1800
--美食可增加的奖励倍数
uMSWrate1 =30000
uMSWrate2 =80000
uMSWrate3 =120000
--saodang
		 uSDrate=10000
		 uSDsweeptimes=9999
		 uSDsweepfreetimes =0
		 uSDamount =50
		uSDprices =	{10, 20, 40, 80, 120, 160, 200, 240, 280, 320, 360, 400, 440, 480, 520}
		
		--复活玩家参数（战役、十二宗宫、勇气试炼、多人副本）
	    uReliveBaseCost = 2
	    uReliveRatio = 10
	    uReliveMaxCost = 320

        --复活多人副本助手参数（单次复活最大花费160元宝）
        uRelivePlayer2BaseCost = 2
        uRelivePlayer2Ratio = 5
        uRelivePlayer2MaxCost = 160
		
		--无限挑战复活
		uSRLdayfreetimes = 0
		uSRLmaxtimes = 3 
		uSRLcosts = {10,20,40}

		--twelvepalace
		 uTPdailyreset = 1
		 uTPneeditemid = 100055
		 uTPcanresetitem = 100055
		 uTPresetlowerlimit = 2
		 uTPbuycost = 50
		 uTPbuybosscost = 50
		 --正义号角购买价格
		 uTPhornbuycost = 150
		 --每天可购买号角数量
		 uTPeachdaybuytimes = 1
		
		--trial 
		-- uTRIALdayfreetimes = 0
		-- uTRIALrelivemaxtimes = 3
		--uTRIALcosts = {10,20,40}
		-- uTRIALplayer2dayfreetimes = 0
		-- uTRIALreliveplayer2maxtimes = 3
		--uTRIALplayer2costs = {5,10,20}
		--客户端用的值是MANY_PEOPLE_GAINS_COST_RMB
		--多人副本的元宝花费、好友加成、快速通关加成、花元宝加成倍率及开启所需vip等级
		uTRIALratecosts =80
		uTRIALFriendRate = 1000
		uTRIALFastRate  = 1000
		uTRIALGainsRate  = 20000
		uTRIALVipNeed  = 5
			
		
		--climbtower
		--每日重置次数
		--需要道具？
		--需要道具？
		--花费
		 uCLIMBTdailyreset = 1
		 uCLIMBTneeditemid = 100066
		 uCLIMBTcanresetitem = 100066
		 uCLIMBTresetlowerlimit = 	2
		 uCLIMBTbuycost = 50
		
	
		--strength
		--体力最大值、每xx秒回复一点体力、每次购买体力花费元宝数
		 uSTmax = 9999
		 uSTtime = 300
		 uSTprices ={50,50,50,100,100,150,150,200}
		 
		 


		 --mysticalshopcost
		 --神秘商店刷新花费元宝依次、佣兵商店刷新花费元宝
		 uMSHOPrefreshtimes ={10,10,20,20,40,40,60,60,80,80}
		 uSSHOPrefreshtimes = {0,0,0,5,5,5,5,5,10,10,10,10,10,20,20,20,20,20,30,30,30}
		 


		 --金币商店刷新花费
		 --勇气商店刷新花费
		 uCOINSHOPrefreshtimes ={10,10,10,10,10,20,20,20,20,20,40,40,40,40,40,80,80,80,80,80}
		 uCOURAGESHOPrefreshtimes = {0,0,0,5,5,5,5,5,10,10,10,10,10,20,20,20,20,20,30,30,30}



		--territorylucky
		--勇气试炼元宝刷新增加幸运值数 
		uTERRITORYLrefreshs = 	{3,3,3,3,3}	
		--付费刷新挑战对象花费
		uTERRITORYLcosts = {5,5,10,10,15}
		--购买挑战次数花费
		uTERRITORYLbuytimess = {5,5,5,5,10,10,10,10,15,15,15,15,20,20,20,20}
		uTERRITORYLmaxtimes = 8
		uTERRITORYLrecovertime = 3600
		--勇气试炼挑战成功增加幸运值
		uTERRITORYLchallage = 2
		--勇气试炼免费刷新次数
		uTERRITORYLfreerefreshtimes = 5
		--勇气试炼免费刷新增加幸运值数
		uTERRITORYLfreerefresh = 	3
		--硬币商店重置花费元宝数
		uTERRITORYLrmbrefresh = 3
		
		--gainwealth
		uGAINWEALTHfreetimes = 3
		--growthfound
		GROWTHFOUNDviplvneed	= 5
		GROWTHFOUNDcost = 1000
        --infinitefight
        --无限挑战相关配置
        --排位赛
		--挑战次数、购买次数花费、挑战对象筛选间隔、胜利+分、失败-分、战报条目数量
		uRankGameTimes = 6
		uRankGameBuyTimesCost = {10,20,40,80,160,320}
		uRankGameNum = {5,8,10,1,3,1,2,2,1}
		uRankGamewinScore = 10
		uRankGameFailScoreCost = 1
		uRankGameReportNum = 10
		--排位赛 商店刷新次数、刷新花费、刷新重置时间
		uRankGameShopRefreshTimes = 2
		uRankGameShopRefreshCost = 30
		uRankGameShopRefreshTime = 21
		--排位赛 段位刷新时间、开启等级、一场战斗最多持续时间（超了算输）
		uRankGameRewardResetTime = 21
		uRankGameMaxFinishTime = 300		
		--戏班行侠仗义刷新任务花费配置（初始花费、每次刷新增加、最大花费）
	    uCatTaskInitGold = 5
	    uCatTaskAddGold = 5
	    uCatTaskMaxGold = 50
	    --进度条金币赠送 最大可领取次数，每次点击给铜钱数量，每次吃鱼给铜钱数量，点击多少次数后可吃到鱼
		uFISHEATmaxtimes = 500
		uFISHEATgivecoin = 10
		uFISHEATeatfish = 500
		uFISHEATmaxpresscount = 15

		--行商猫初始重置需要的元宝，每次重置累加的元宝，最大需要多少元宝
		uBusinessCatRefreshInit = 10
		uBusinessCatRefreshAdd = 5
		uBusinessCatRefreshMax = 50

		--公会玩法开启等级（依据公会等级）
		uGuildOpenBattle = 1 --木猫阵法开启等级
		uGuildOpenYuanWai = 1 --猫员外开启等级
		uGuildOpenSign = 1 -- 戏班签到开启等级
		uGuildOpenBusinessCat = 1 --行商猫外开启等级
		uGuildOpenKitchen = 1 --厨房训练开启等级
		uGuildOpenTicket = 1 --票友集会开启等级
		uGuildOpenCatTask = 1 --行侠仗义开启等级

		--701=赏罚令每日免费单抽重置时间
		--802=普通难度冒险（包含普通+精英关卡）可挑战次数每日重置时间
		--803=大师难度冒险（不包含哥布林关卡）可挑战次数每日重置时间
		--903=每日任务每日重置时间
		--1302=体力购买每日重置次数时间
		--1303=拜财神每日重置次数时间
		--1404=月签到每日判断时间
		--1408=三庆便当每日重置时间
		--1501=招福集市每日可挑战次数重置时间
		--1601=巴山试炼每日可挑战次数重置时间
		--1702=排位赛每日可挑战次数重置时间
		--1703=排位赛每日可额外购买次数重置时间
		--1801=无限挑战每日可挑战次数重置时间
		--1803=勇气试炼每日可额外购买挑战次数重置时间
		--1804=勇气试炼免费刷新挑战对象次数重置时间1
		--1805=勇气试炼免费刷新挑战对象次数重置时间2
		--1901=十二宗宫每日副本重置时间
		--中括号内的填写方法为[时间,id,时间,id]
		uSystemRefreshTime={0,701,0,903,0,1404,0,1408,0,1501,7200,1801,14400,802,14400,803,14400,1601,14400,1901,21600,1702,21600,1703,0,1803,21600,1804,64800,1805,21600,1302,21600,1303}
		
		sRole1=[1,10713,1,"灵的天宇",0,0,"","",[462,0,17,0,10,0,0,0],[287,100,94,24,7,2,2,0,0,8,30,800,600,175,99,8,0,0,0,0,0,0,14,5000,8,0,0,0,0,0,0,99999,0,0,0,0],[-101],[6001,0,0,0,0,0],[[1003,1,1],[1004,1,2],[1005,1,3],[1006,0,0],[1007,0,0],[1008,0,0],[1009,1,0],[1010,1,0],[1011,1,0]],[1,0,{}],[0,0,0,0,0,0,0,0,0,0,0,0],[[-1],[-1],[-1],[-1],[-1],[-1]],[[[0,0,0,0,0],[0,0,0,0,0],[0,0,0,0,0],[-1,-1,-1,-1,0],[-1,-1,-1,-1,0]],[[-1,-1,-1,-1,1],[-1,-1,-1,-1,1],[-1,-1,-1,-1,1],[-1,-1,-1,-1,1],[-1,-1,-1,-1,1],[-1,-1,-1,-1,1],[-1,-1,-1,-1,1]],{}],[[6001,[-1,-1,-1,-1,-1,-1]],[0,[-1,-1,-1,-1,-1,-1]],[0,[-1,-1,-1,-1,-1,-1]],[0,[-1,-1,-1,-1,-1,-1]],[0,[-1,-1,-1,-1,-1,-1]],[0,[-1,-1,-1,-1,-1,-1]]],[{},{},{}],[[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0]],[[[4,17]],{},{},{},{},{}]]
		sRole2=[2,10714,1,"到的东东",3,0,"","",[462,0,17,0,10,0,0,0],[287,100,94,24,7,2,2,0,0,8,30,800,600,175,99,8,0,0,0,0,0,0,14,5000,8,0,0,0,0,0,0,99999,0,0,0,0],[-201,301],[7001,0,0,0,0,0],[[2003,1,1],[2004,1,2],[2005,1,3],[2009,1,0],[2010,1,0],[2011,1,0]],[1,0,{}],[0,0,0,0,0,0,0,0,0,0,0,0],[[-1],[-1],[-1],[-1],[-1],[-1]],[[[0,0,0,0,0],[0,0,0,0,0],[0,0,0,0,0],[-1,-1,-1,-1,0],[-1,-1,-1,-1,0]],[[-1,-1,-1,-1,1],[-1,-1,-1,-1,1],[-1,-1,-1,-1,1],[-1,-1,-1,-1,1],[-1,-1,-1,-1,1],[-1,-1,-1,-1,1],[-1,-1,-1,-1,1]],{}],[[7001,[-1,-1,-1,-1,-1,-1]],[0,[-1,-1,-1,-1,-1,-1]],[0,[-1,-1,-1,-1,-1,-1]],[0,[-1,-1,-1,-1,-1,-1]],[0,[-1,-1,-1,-1,-1,-1]],[0,[-1,-1,-1,-1,-1,-1]]],[{},{},{}],[[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0]],[[[4,17]],{},{},{},{},{}]]
		sRole3=[3,10714,1,"到的东东",0,0,"","",[462,0,17,0,10,0,0,0],[287,100,94,24,7,2,2,0,0,8,30,800,600,175,99,8,0,0,0,0,0,0,14,5000,8,0,0,0,0,0,0,99999,0,0,0,0],[-301],[8001,0,0,0,0,0],[[3003,1,1],[3004,1,2],[3005,1,3],[3006,0,0],[3007,0,0],[3008,0,0],[3009,1,0],[3010,1,0],[3011,1,0]],[1,0,{}],[0,0,0,0,0,0,0,0,0,0,0,0],[[-1],[-1],[-1],[-1],[-1],[-1]],[[[0,0,0,0,0],[0,0,0,0,0],[0,0,0,0,0],[-1,-1,-1,-1,0],[-1,-1,-1,-1,0]],[[-1,-1,-1,-1,1],[-1,-1,-1,-1,1],[-1,-1,-1,-1,1],[-1,-1,-1,-1,1],[-1,-1,-1,-1,1],[-1,-1,-1,-1,1],[-1,-1,-1,-1,1]],{}],[[8001,[-1,-1,-1,-1,-1,-1]],[0,[-1,-1,-1,-1,-1,-1]],[0,[-1,-1,-1,-1,-1,-1]],[0,[-1,-1,-1,-1,-1,-1]],[0,[-1,-1,-1,-1,-1,-1]],[0,[-1,-1,-1,-1,-1,-1]]],[{},{},{}],[[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0],[0,0,0,0,0,0]],[[[4,17]],{},{},{},{},{}]]
		uRolePower1=462
		uRolePower2=462
		uRolePower3=462
		--关卡完成时间增加的误差值，前端和后端统计的时间超过这个误差值就算作弊（秒）
		uCopyFinishTimeDeviation=2

		--戏班中各玩法重置时间
		--签到
		uConsortSignReset = 0
		--行商猫
		uBusinessCatReset = 0
		--票友集会
		uTicketFriendReset = 0
		--眼力训练
		uEyesightReset = 0
		--厨房特训
		uKitchenReset = 0
		--行侠仗义
		uXingXiaReset = 0
		--口才修炼
		uEloquenceReset = 0
        --木猫阵法
        UWoodencatReset = 9

		--赏罚令免费抽单日最大次数
		uRewardLotteryFreeOnceMaxTimes = 5

		--木猫阵法购买buff花费
		--攻击buff花费
		uWoodencatattackbuffcost = 50
		--防御buff花费
		uWoodencatdefensebuffcost = 50
		--暴击buff花费
		uWoodencatCritbuffcost = 50

